openfoam_container/simulation/fene_p/expansion/actual/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    outlet
    {
        type            patch;
        nFaces          133;
        startFace       100057;
    }
    fixedWalls
    {
        type            wall;
        nFaces          1152;
        startFace       100190;
        closedSolidBodyMotion false;
    }
    inlet
    {
        type            patch;
        nFaces          33;
        startFace       101342;
    }
    frontAndBack
    {
        type            empty;
        nFaces          100716;
        startFace       101375;
    }
)


// ************************************************************************* //
